//
//  Information.h
//  Malayalam Bible
//
//  Created by Jeesmon Jacob on 10/21/11.
//  Copyright (c) 2011 __MyCompanyName__. All rights reserved.
//

#import <UIKit/UIKit.h>

@interface Information : UIViewController {
    UIWebView *webView;
}

@property (nonatomic, retain) IBOutlet UIWebView *webView;

@end


/**** Update queries on database +20131127, +20131205
update verses set verse_text='ഒരുത്തൻ നേർച്ചനിവൃത്തിക്കായിട്ടോ സ്വമേധാദാനമായിട്ടൊ  യഹോവെക്കു മാടുകളിൽനിന്നാകട്ടെ ആടുകളിൽനിന്നാകട്ടെ ഒന്നിനെ സാമാധാനയാഗമായിട്ടു അര്‍പ്പിക്കുമ്പോള്‍ അതു പ്രസാദമാകുവാന്തക്കവണ്ണം ഊനമില്ലത്തതായിരിക്കേണം; അതിന്നു ഒരു കുറവും ഉണ്ടായിരിക്കരുതു.' where book_id=3 and chapter_id=22 and verse_id=21;
update verses set verse_text='അപ്പോൾ മറിയ പറഞ്ഞതു: “എന്റെ ഉള്ളം കർത്താവിനെ മഹിമപ്പെടുത്തുന്നു;' where book_id=42 and chapter_id=1 and verse_id=46;
update verses set verse_text='കർത്താവിന്റെ പ്രസാദവർഷം പ്രസംഗിപ്പാനും എന്നെ അയച്ചിരിക്കുന്നു” എന്നു എഴുതിയിരിക്കുന്ന സ്ഥലം കണ്ടു.' where book_id=42 and chapter_id=4 and verse_id=19;

 update verses set verse_text='ആദിയിൽ ദൈവം ആകാശവും ഭൂമിയും സൃഷ്ടിച്ചു.' where book_id=1 and chapter_id=1 and verse_id=1;
 update verses set verse_text='വരുന്നവരും പോകുന്നവരും വളരെ ആയിരുന്നതിനാൽ അവർക്കു ഭക്ഷിപ്പാൻ പോലും സമയം ഇല്ലായ്കകൊണ്ടു അവൻ  അവരോടു: “നിങ്ങൾ ഒരു ഏകാന്തസ്ഥലത്തു വേറിട്ടുവന്നു അല്പം ആശ്വസിച്ചുകൊൾവിൻ” എന്നു പറഞ്ഞു.' where book_id=41 and chapter_id=6 and verse_id=31;
 update verses set verse_text='അങ്ങനെ അവർ യേശുവിനോടു: ഞങ്ങൾക്കു അറിഞ്ഞുകൂടാ എന്നു ഉത്തരം പറഞ്ഞു. "എന്നാൽ ഞാനും ഇതു ഇന്ന അധികാരംകൊണ്ടു ചെയ്യുന്നു എന്നു നിങ്ങളോടു പറയുന്നില്ല"  എന്നു യേശു അവരോടു പറഞ്ഞു.' where book_id=41 and chapter_id=11 and verse_id=33;


 update verses set verse_text='കൂരിരുൾതാഴ്‌വരയിൽ കൂടി നടന്നാലും ഞാൻ ഒരു അനർത്ഥവും ഭയപ്പെടുകയില്ല; നീ എന്നോടുകൂടെ ഇരിക്കുന്നുവല്ലോ; നിന്റെ വടിയും കോലും എന്നെ ആശ്വസിപ്പിക്കുന്നു.' where book_id=19 and chapter_id=23 and verse_id=4;
 update verses set verse_text='നായ്ക്കളെ സൂക്ഷിപ്പിൻ; ആകാത്ത വേലക്കാരെ സൂക്ഷിപ്പിൻ; വിച്ഛേദനക്കാരെ സൂക്ഷിപ്പിൻ.' where book_id=50 and chapter_id=3 and verse_id=2;
 update verses set verse_text='അതിന്നു മോശെ: ഞാൻ വാഗ്വൈഭവമില്ലാത്തവൻ; ഫറവോൻ എന്റെ വാക്കു എങ്ങനെ കേൾക്കും എന്നു യഹോവയുടെ സന്നിധിയിൽ പറഞ്ഞു.' where book_id=2 and chapter_id=6 and verse_id=30;
 update verses set verse_text='യെഹൂദമതത്തിലെ എന്റെ മുമ്പത്തെ നടപ്പു നിങ്ങൾ കേട്ടിട്ടുണ്ടല്ലോ. ഞാൻ ദൈവത്തിന്റെ സഭയെ അത്യന്തം ഉപദ്രവിച്ചു മുടിക്കയും' where book_id=48 and chapter_id=1 and verse_id=13;
 update verses set verse_text='കൊള്ളയിടുന്നവൻ എല്ലാപട്ടണത്തിലും വരും; ഒരു പട്ടണവും ഒഴിഞ്ഞുപോകയില്ല; യഹോവ അരുളിച്ചെയ്തതുപോലെ താഴ്‌വര നശിച്ചുപോകും; സമഭൂമി ശൂന്യമായ്തീരും.' where book_id=24 and chapter_id=48 and verse_id=8;
 update verses set verse_text='ശബ്ബത്ത്‌നാളിലോ ഒരു വയസ്സു പ്രായമുള്ള ഊനമില്ലാത്ത രണ്ടു കുഞ്ഞാടിനെയും ഭോജനയാഗത്തിന്നായി എണ്ണചേർത്ത രണ്ടിടങ്ങഴി മാവും അതിന്റെ പാനീയയാഗവും അർപ്പിക്കേണം.' where book_id=4 and chapter_id=28 and verse_id=9;
 
 update verses set verse_text='ശേഷം ഗിലെയാദും ഓഗിന്റെ രാജ്യമായ ബാശാൻ മുഴുവനും അർഗ്ഗോബ്‌ദേശം മുഴുവനും ഞാൻ മനശ്ശെയുടെ പാതിഗോത്രത്തിന്നു കൊടുത്തു. - ബാശാന്നു മുഴുവന്നും മല്ലന്മാരുടെ ദേശം എന്നു പേർ പറയുന്നു.' where book_id=5 and chapter_id=3 and verse_id=13;
 update verses set verse_text='മനശ്ശെയുടെ മകനായ യായീർ ഗെശൂർയ്യരുടെയും മാഖാത്യരുടെയും അതിർവരെ അർഗ്ഗോബ്‌ദേശം മുഴുവനും പിടിച്ചു തന്റെ പേരിൻ പ്രകാരം ബാശാന്നു ഹവോത്ത് - യായീർ എന്നു പേർ ഇട്ടു; ഇന്നുവരെ ആ പേർ തന്നേ പറഞ്ഞു വരുന്നു.' where book_id=5 and chapter_id=3 and verse_id=14;
 update verses set verse_text='അതിലെ കൊള്ളയൊക്കെയും വീഥിയുടെ നടുവിൽ കൂട്ടി ആ പട്ടണവും അതിലെ കൊള്ളയൊക്കെയും അശേഷം നിന്റെ ദൈവമായ യഹോവെക്കായി തീയിട്ടു ചുട്ടുകളയേണം; അതു എന്നും പാഴ്‌കുന്നായിരിക്കേണം; അതിനെ പിന്നെ പണികയുമരുതു.' where book_id=5 and chapter_id=13 and verse_id=17;
 update verses set verse_text='ആ ജാതികളുടെ ദേവന്മാരെ ചെന്നു സേവിക്കേണ്ടതിന്നു ഇന്നു നമ്മുടെ ദൈവമായ യഹോവയെ വിട്ടുമാറുവാൻ മനസ്സുള്ള യാതൊരു പുരുഷനും സ്ത്രീയും യാതൊരു കുലവും ഗോത്രവും നിങ്ങളിൽ ഉണ്ടാകരുതു; നഞ്ചും കൈപ്പുമുള്ള ഫലം കായ്ക്കുന്ന യാതൊരുവേരും അരുതു.' where book_id=5 and chapter_id=29 and verse_id=17;
 
 update verses set verse_text='സെബൂൽ അവനോടു: നാം അബീമേലെക്കിനെ സേവിക്കേണ്ടതിന്നു അവൻ ആരെന്നു പറഞ്ഞ നിന്റെ വായ് ഇപ്പോൾ എവിടെ? ഇതു നീ പുച്ഛിച്ച പടജ്ജനം അല്ലയോ? ഇപ്പോൾ പുറപ്പെട്ടു അവരോടു പൊരുക എന്നു പറഞ്ഞു.' where book_id=7 and chapter_id=9 and verse_id=38;
 
 update verses set verse_text='കുറെക്കാലം കഴിഞ്ഞിട്ടു കോതമ്പുകൊയ്ത്തുകാലത്തു ശിംശോൻ ഒരു കോലാട്ടിൻകുട്ടിയെയുംകൊണ്ടു തന്റെ ഭാര്യയെ കാണ്മാൻ ചെന്നു: ശയനഗൃഹത്തിൽ എന്റെ ഭാര്യയുടെ അടുക്കൽ ഞാൻ കടന്നുചെല്ലട്ടെ എന്നു പറഞ്ഞു. അവളുടെ അപ്പനോ അവനെ അകത്തു കടപ്പാൻ സമ്മതിക്കാതെ:' where book_id=7 and chapter_id=15 and verse_id=1;
 update verses set verse_text='അവന്റെ ഹൃദയം മറിഞ്ഞുപോകാതിരിപ്പാൻ അനേകം ഭാര്യമാരെ അവൻ എടുക്കരുതു; വെള്ളിയും പൊന്നും അധികമായി സമ്പാദിക്കയും അരുതു.' where book_id=5 and chapter_id=17 and verse_id=17;

 update verses set verse_text='ഗിലെയാദിലെ രാമോത്തിൽ ബെൻ-ഗേബെർ; അവന്റെ ഇടവക മനശ്ശെയുടെ മകനായ യായീരിന്നു ഗിലെയാദിലുള്ള പട്ടണങ്ങളും മതിലുകളും ചെമ്പോടാമ്പലുകളും ഉള്ള അറുപതു വലിയ പട്ടണങ്ങൾ ഉൾപ്പെട്ട ബാശാനിലെ അർഗ്ഗോബ്‌ദേശവും ആയിരുന്നു,' where book_id=11 and chapter_id=4 and verse_id=13;
 update verses set verse_text='നിന്റെ ജനമായ യിസ്രായേൽ നിന്നോടു പാപം ചെയ്കനിമിത്തം അവർ ശത്രുവിനോടു തോറ്റിട്ടു നിങ്കലേക്കു തിരിഞ്ഞു നിന്റെ നാമത്തെ സ്വീകരിച്ചുകൊണ്ടു ഈ ആലയത്തിൽവെച്ചു നിന്നോടു പ്രാർത്ഥിക്കയും യാചിക്കയും ചെയ്താൽ' where book_id=11 and chapter_id=8 and verse_id=33;
 update verses set verse_text='ഭൂതങ്ങൾ ആ മനുഷ്യനെ വിട്ടു പന്നികളിൽ കടന്നപ്പോൾ കൂട്ടം കടുന്തൂക്കത്തൂടെ തടാകത്തിലേക്കു പാഞ്ഞു വീർപ്പുമുട്ടി ചത്തു.' where book_id=42 and chapter_id=8 and verse_id=33;
 update verses set verse_text='യെഹൂദാഗൃഹത്തിൽ ശേഷിച്ചിരിക്കുന്ന ഒരു രക്ഷിതഗണം വീണ്ടും താഴെ വേരൂന്നി മീതെ ഫലം കായ്ക്കും.' where book_id=12 and chapter_id=19 and verse_id=30;
 update verses set verse_text='ഇങ്ങനെ ശുശ്രൂഷക്രമത്തിലായി; രാജകല്പനപ്രകാരം പുരോഹിതന്മാർ തങ്ങളുടെ സ്ഥാനത്തും ലേവ്യർ കൂറുകൂറായും നിന്നു.' where book_id=14 and chapter_id=35 and verse_id=10;
 update verses set verse_text='മോശെയുടെ പുസ്തകത്തിൽ എഴുതിയിരിക്കുന്നതുപോലെ അവർ യെരൂശലേമിലുള്ള ദൈവത്തിന്റെ ശുശ്രൂഷെക്കു പുരോഹിതന്മാരെ കൂറുകൂറായും ലേവ്യരെ തരംതരമായും നിർത്തി.' where book_id=15 and chapter_id=6 and verse_id=18;
 update verses set verse_text='യിസ്രായേലിനോടുള്ള യഹോവയുടെ കല്പനകളുടെയും ചട്ടങ്ങളുടെയും വാക്യങ്ങളിൽ വിദഗ്ദ്ധശാസ്ത്രിയായ എസ്രാപുരോഹിതന്നു അർത്ഥഹ് ശഷ്ടാരാജാവു കൊടുത്ത എഴുത്തിന്റെ പകർപ്പാവിതു:' where book_id=15 and chapter_id=7 and verse_id=11;
 update verses set verse_text='രാജാധിരാജാവായ അർത്ഥഹ് ശഷ്ടാവു സ്വർഗ്ഗത്തിലെ ദൈവത്തിന്റെ ന്യായപ്രമാണത്തിൽ ശാസ്ത്രിയായ എസ്രാപുരോഹിതന്നു എഴുതുന്നതു: ഇത്യാദി.' where book_id=15 and chapter_id=7 and verse_id=12;
 update verses set verse_text='എന്നാൽ നിന്റെ ദൈവത്തിന്റെ ന്യായപ്രമാണവും രാജാവിന്റെ ന്യായപ്രമാണവും അനുസരിക്കാത്ത ഏവനെയും ജാഗ്രതയോടെ ന്യായം വിസ്തരിച്ചു മരണമോ പ്രവാസമോ പിഴയോ തടവോ അവന്നു കല്പിക്കേണ്ടതാകുന്നു.' where book_id=15 and chapter_id=7 and verse_id=26;
 update verses set verse_text='ഭൂമിയിൽ എങ്ങും വിത്തുള്ള സസ്യങ്ങളും വൃക്ഷത്തിന്റെ വിത്തുള്ള ഫലം കായ്ക്കുന്ന സകലവൃക്ഷങ്ങളും ഇതാ, ഞാൻ നിങ്ങൾക്കു തന്നിരിക്കുന്നു; അവ നിങ്ങൾക്കു ആഹാരമായിരിക്കട്ടെ;' where book_id=1 and chapter_id=1 and verse_id=29;
 update verses set verse_text='അവർ ഇടയന്മാർ ആകുന്നു; കന്നുകാലികളെ മേയ്ക്കുന്നതു അവരുടെ തൊഴിൽ; അവർ തങ്ങളുടെ ആടുകളെയും കന്നുകാലികളെയും തങ്ങൾക്കുള്ളതൊക്കെയും കൊണ്ടുവന്നിട്ടുണ്ടു എന്നു അവനോടു പറയും.' where book_id=1 and chapter_id=46 and verse_id=32;

  **/
 /**** following will be iOS specific ***
  
  update verses set verse_text='അവർ മരുഭൂമിയിൽകൂടി സഞ്ചരിച്ചു എദോംദേശവും മോവാബ്‌ദേശവും ചുറ്റിച്ചെന്നു മോവാബ് ദേശത്തിന്റെ കിഴക്കു എത്തി അർന്നോന്നക്കരെ പാളയമിറങ്ങി; അർന്നോൻ മോവാബിന്റെ അതിരായിരുന്നു. മോവാബിന്റെ അതിർക്കകത്തു അവർ കടന്നില്ല. ' where book_id=7 and chapter_id=11 and verse_id=18;
  update verses set verse_text='അപ്പോൾ അവൻ ആ വീണ്ടെടുപ്പുകാരനോടു പറഞ്ഞതു: മോവാബ്‌ദേശത്തുനിന്നു മടങ്ങിവന്നിരിക്കുന്ന നൊവൊമി നമ്മുടെ സഹോദരനായ എലീമേലെക്കിന്റെ വയൽ വില്ക്കുന്നു. ആകയാൽ നിന്നോടു അതു അറിയിപ്പാൻ ഞാൻ വിചാരിച്ചു; ഇവിടെ ഇരിക്കുന്നവരുടെയും ജനത്തിന്റെ മൂപ്പന്മാരുടെയും മുമ്പാകെ നീ അതു വിലെക്കു വാങ്ങുക;' where book_id=8 and chapter_id=4 and verse_id=3;
  update verses set verse_text='അനന്തരം മോശെ മോവാബ്‌സമഭൂമിയിൽനിന്നു യെരീഹോവിന്നെതിരെയുള്ള നെബോപർവ്വതത്തിൽ ‌പിസ്ഗാമുകളിൽ കയറി; യഹോവ ദാൻവരെ ഗിലെയാദ്‌ദേശം ഒക്കെയും' where book_id=5 and chapter_id=34 and verse_id=1;
  update verses set verse_text='യിസ്രായേൽമക്കൾ മോശെയെക്കുറിച്ചു മോവാബ്‌സമഭൂമിയിൽ മുപ്പതുദിവസം കരഞ്ഞുകൊണ്ടിരുന്നു; അങ്ങനെ മോശെയെക്കുറിച്ചു കരഞ്ഞു വിലപിക്കുന്ന കാലം തികഞ്ഞു.' where book_id=5 and chapter_id=34 and verse_id=8;
  update verses set verse_text='അങ്ങനെ യഹോവയുടെ ദാസനായ മോശെ യഹോവയുടെ വചനപ്രകാരം അവിടെ മോവാബ്‌ദേശത്തുവെച്ചു മരിച്ചു.' where book_id=5 and chapter_id=34 and verse_id=5;
  update verses set verse_text='അവൻ അവനെ മോവാബ്‌ദേശത്തു ബെത്ത്പെയോരിന്നെതിരെയുള്ള താഴ്വരയിൽ അടക്കി; എങ്കിലും ഇന്നുവരെയും അവന്റെ ശവക്കുഴിയുടെ സ്ഥലം ആരും അറിയുന്നില്ല.' where book_id=5 and chapter_id=34 and verse_id=6;
  update verses set verse_text='അവൻ അവനെ മോവാബ്‌ദേശത്തു ബേത്ത്‌-പെയോരിന്നെതിരെയുള്ള താഴ്‌വരയിൽ അടക്കി; എങ്കിലും ഇന്നുവരെയും അവന്റെ ശവക്കുഴിയുടെ സ്ഥലം ആരും അറിയുന്നില്ല.' where book_id=5 and chapter_id=34 and verse_id=6;
  update verses set verse_text='ബദ്ധന്മാരെ അപഹൃതത്തോടും കൊള്ളയോടുംകൂടെ യെരീഹോവിന്റെ സമീപത്തു യോർദ്ദാന്നരികെയുള്ള മോവാബ്‌സമഭൂമിയിൽ പാളയത്തിലേക്കു മോശെയുടെയും പുരോഹിതനായ എലെയാസാരിന്റെയും യിസ്രായേൽസഭയുടെയും അടുക്കൽകൊണ്ടു വന്നു.' where book_id=4 and chapter_id=31 and verse_id=12;
  update verses set verse_text='അബാരീംപർവ്വതത്തിങ്കൽ നിന്നു പുറപ്പെട്ടു യെരീഹോവിന്നെതിരെ യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽ പാളയമിറങ്ങി.' where book_id=4 and chapter_id=33 and verse_id=48;
  update verses set verse_text='യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽ ബേത്ത്-യെശീമോത്ത് മുതൽ ആബേൽ-ശിത്തീംവരെ പാളയമിറങ്ങി.' where book_id=4 and chapter_id=33 and verse_id=49;
  update verses set verse_text='യെരീഹോവിന്നെതിരെ യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽവെച്ചു യഹോവ മോശെയോടു അരുളിച്ചെയ്തതു:' where book_id=4 and chapter_id=33 and verse_id=50;
  update verses set verse_text='യെരീഹോവിന്നെതിരെ യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽവെച്ചു യഹോവ മോശെമുഖാന്തരം യിസ്രായേൽമക്കളോടു കല്പിച്ച കല്പനകളും വിധികളും ഇവ തന്നേ.' where book_id=4 and chapter_id=36 and verse_id=13;
  update verses set verse_text='ഇങ്ങനെ അവൻ തനിക്കുള്ള സകലവുമായി ഓടിപ്പോയി; അവൻ പുറപ്പെട്ടു നദി കടന്നു. ഗിലെയാദ്‌പർവ്വതത്തിനു നേരെ തിരിഞ്ഞു.' where book_id=1 and chapter_id=31 and verse_id=21;
  update verses set verse_text='ഉടനെ അവൻ തന്റെ സഹോദരന്മാരെ കൂട്ടിക്കൊണ്ടു ഏഴു ദിവസത്തെ വഴി അവനെ പിന്തുടർന്നു ഗിലെയാദ്‌പർവ്വതത്തിൽ അവനോടു ഒപ്പം എത്തി.' where book_id=1 and chapter_id=31 and verse_id=23;
  update verses set verse_text='ലാബാൻ യാക്കോബിനോടു ഒപ്പം എത്തി; യാക്കോബ് പർവ്വതത്തിൽ കൂടാരം അടിച്ചിരുന്നു; ലാബാനും തന്റെ സഹോദരന്മാരുമായി ഗിലെയാദ്‌പർവ്വതത്തിൽ കൂടാരം അടിച്ചു.' where book_id=1 and chapter_id=31 and verse_id=25;
  
update verses set verse_text='യെരീഹോവിന്റെ സമീപത്തു യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽവെച്ചു യിസ്രായേൽമക്കളെ എണ്ണിയപ്പോൾ മോശെയും പുരോഹിതനായ എലെയാസാരും എണ്ണിയവർ ഇവർ തന്നേ.' where book_id=4 and chapter_id=26 and verse_id=63;
update verses set verse_text='യഹോവ പിന്നെയും യെരീഹോവിന്നെതിരെ യോർദ്ദാന്നരികെ മോവാബ്‌സമഭൂമിയിൽവെച്ചു മോശെയോടു അരുളിച്ചെയ്തതു:' where book_id=4 and chapter_id=35 and verse_id=1;
update verses set verse_text='ഇതു മോശെ യെരീഹോവിന്നു കിഴക്കു യോർദ്ദാന്നക്കരെ മോവാബ്‌സമഭൂമിയിൽവെച്ചു ഭാഗിച്ചുകൊടുത്ത അവകാശം ആകുന്നു.' where book_id=6 and chapter_id=13 and verse_id=32;
 
**/